src/InformationRegisters/СтекОбновленияЭлектронныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекОбновленияЭлектронныхКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтекОбновленияЭлектронныхКарт/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура, добавляет запись в стек.
//
Процедура ДобавитьЗаписьВСтек(Карта, Параметр, Значение) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда		
		УстановитьПривилегированныйРежим(Истина);			
	КонецЕсли;
	
	Если Константы.ИспользоватьWallet.Получить() = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	Запись = РегистрыСведений.СтекОбновленияЭлектронныхКарт.СоздатьМенеджерЗаписи();		
	
	Запись.Карта	= Карта;
	Запись.Параметр = Параметр;
	Запись.Значение = Значение;
	
	Запись.Записать();
	
КонецПроцедуры

// Процедура, обновляет электронные карты.
//
Процедура ОбновитьЭлектронныеКарты(ВСWallet) Экспорт
	
	Если Константы.ИспользоватьWallet.Получить() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 200
	|	СтекОбновленияЭлектронныхКарт.Карта.ВнутреннийКодКарты КАК ВнутреннийКодКарты,
	|	СтекОбновленияЭлектронныхКарт.Карта КАК Карта,
	|	СтекОбновленияЭлектронныхКарт.Параметр КАК Параметр,
	|	СтекОбновленияЭлектронныхКарт.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.СтекОбновленияЭлектронныхКарт КАК СтекОбновленияЭлектронныхКарт
	|ГДЕ
	|	СтекОбновленияЭлектронныхКарт.Карта.ВнутреннийКодКарты <> """"
	|ИТОГИ ПО
	|	ВнутреннийКодКарты");
	
	ВыборкаПоКартам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДанныхДляОбновления = Новый Массив();
	
	ТаблицаДанных = РегистрыСведений.СтекОбновленияЭлектронныхКарт.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("ВнутреннийКодКарты", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	
	Пока ВыборкаПоКартам.Следующий() Цикл
		
		МассивДанныхДляОбновления.Добавить(ПолучитьДанныеДляОбновления(ВыборкаПоКартам, ТаблицаДанных));
				
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивДанныхДляОбновления) Тогда
		
		ОбновитьКарты(МассивДанныхДляОбновления, ВСWallet, ТаблицаДанных);			
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обновляет электронные карты.
//
Процедура ОбновитьКарты(МассивДанныхДляОбновления, ВнешняяСистема, ТаблицаДанных)

	МассивИдентификаторовДляУдаления = Новый Массив();
	
	РезультатОбновления = Справочники.Карты.ОбновитьКарты(МассивДанныхДляОбновления, ВнешняяСистема);
	
	Если Не РезультатОбновления.Успешно Тогда
		
		ЗаписьЖурналаРегистрации("ОбновлениеЭлектронныхКарт", УровеньЖурналаРегистрации.Ошибка,,, РезультатОбновления.ОписаниеОшибки);
		
	Иначе
		
		Для Каждого РезультатОбновленияКарты Из РезультатОбновления.data Цикл
			
			Если РезультатОбновленияКарты.Значение["success"] // успешно обновили карту, удаляем записи.
				Или СтрНайти(РезультатОбновленияКарты.Значение["error"]["message"], "недействительный номер телефона") > 0 Тогда // не удалось обновить номер телефона, удаляем 
				
				МассивИдентификаторовДляУдаления.Добавить(РезультатОбновленияКарты.Ключ);	
				
			ИначеЕсли РезультатОбновленияКарты.Значение["error"]["code"] = "not_found" Тогда // карта не найдена, удаляем записи и помечаем на удаление.      
				
				МассивИдентификаторовДляУдаления.Добавить(РезультатОбновленияКарты.Ключ);
				
				ПометитьКартуНаУдаление(РезультатОбновленияКарты.Ключ); 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбработатьРезультатОбновленияКарт(МассивИдентификаторовДляУдаления, ТаблицаДанных);
		
КонецПроцедуры

// Процедура, помечает карту на удаление.
//
Процедура ПометитьКартуНаУдаление(ВнутреннийКодКарты)
	
	Карта = Справочники.Карты.НайтиПоРеквизиту("ВнутреннийКодКарты", ВнутреннийКодКарты);
	
	Если ЗначениеЗаполнено(Карта) И Не Карта.ПометкаУдаления Тогда
		
		КартаОбъект = Карта.ПолучитьОбъект();
		КартаОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обрабатывает результаты обновления электронных карт.
//
Процедура ОбработатьРезультатОбновленияКарт(МассивИдентификаторовДляУдаления, ТаблицаДанных)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДанных.ВнутреннийКодКарты КАК ВнутреннийКодКарты,
	|	ТаблицаДанных.Карта КАК Карта,
	|	ТаблицаДанных.Параметр КАК Параметр,
	|	ТаблицаДанных.Значение КАК Значение
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДанных.Карта КАК Карта,
	|	ТаблицаДанных.Параметр КАК Параметр,
	|	ТаблицаДанных.Значение КАК Значение
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.ВнутреннийКодКарты В(&МассивИдентификаторовДляУдаления)");
	
	Запрос.УстановитьПараметр("МассивИдентификаторовДляУдаления", МассивИдентификаторовДляУдаления);
	Запрос.УстановитьПараметр("ТаблицаДанных"					, ТаблицаДанных);
	
	ТаблицаУдаляемыхДанных = Запрос.Выполнить().Выгрузить();	
	
	Если ЗначениеЗаполнено(ТаблицаУдаляемыхДанных) Тогда		
		
		МенеджерЗаписи = РегистрыСведений.СтекОбновленияЭлектронныхКарт.СоздатьМенеджерЗаписи();	
		
		Для Каждого СтрокаДанных Из ТаблицаУдаляемыхДанных Цикл
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаДанных);
			
			МенеджерЗаписи.Удалить();
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры

// Функция, возвращает данные для обновления.
//
Функция ПолучитьДанныеДляОбновления(ВыборкаПоКартам, ТаблицаДанных)
	
	ДанныеДляОбновления = Новый Структура("serial_number, fields", ВыборкаПоКартам.ВнутреннийКодКарты, Новый Структура());
	
	ВыборкаПоПолямКарты = ВыборкаПоКартам.Выбрать();
	
	Пока ВыборкаПоПолямКарты.Следующий() Цикл
		
		ДанныеДляОбновления.fields.Вставить(ВыборкаПоПолямКарты.Параметр, ВыборкаПоПолямКарты.Значение);
		
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), ВыборкаПоПолямКарты); 
		
	КонецЦикла;
	
	Возврат ДанныеДляОбновления;
	
КонецФункции

#КонецОбласти
